<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9bd7b9a021dceab18a3ae94f1b8f038b32bfd40f8c8677c39493776a0a60547f","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #797 at https://github.com/cal-itp/data-infra/actions/runs/18544815951","plan_out_hash":"2f20bfed7b48eefdb7f95675ef0258169608a661a9aa24c9b9314a8a657313cf","plan_hash":"d6766d8953bfa081a9b751f0076aa5ea3b04ac053e5c4c42c5da2c788ff7aa0a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["dbt_project.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "XPuwJQ==" -> (known after apply)
!~      detect_md5hash      = "ZVQqwNQ/pizS7TrWVGpWrA==" -> "different hash"
!~      generation          = 1755538683311062 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/dbt_project.yml"
!~      md5hash             = "ZVQqwNQ/pizS7TrWVGpWrA==" -> (known after apply)
        name                = "data/warehouse/dbt_project.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #797](https://github.com/cal-itp/data-infra/actions/runs/18544815951)